# HideLayer

## Description
Procedure HideLayer sets the visibility status of the active layer to hidden. Objects on hidden layers will not be viewable from other layers.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE HideLayer;
```

```python

def vs.HideLayer():
    return None
```

## Examples
```pascal
Layer('Future Construction');

HideLayer;

{hides the layer 'Future Construction'}
```

## Version
Availability: from MiniCAD
## Category
* Layers